In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy.sql import text
import psycopg2
import Config

df_ny = pd.read_csv("C:/Users/micha/PycharmProjects/Docs/MTA_Monthly_Ridership___Traffic_Data__Beginning_January_2008.csv")
df_ch = pd.read_csv("C:/Users/micha/PycharmProjects/Docs/CTA_-_Ridership_-_Daily_Boarding_Totals_20240307.csv")

DB_NAME = "Public_Transit"
DB_USER = "postgres"
DB_PASS = Config.auth
DB_HOST = "localhost"
DB_PORT = "5432"

engine = create_engine(f"postgresql://{DB_USER}:{DB_PASS}@{DB_HOST}/{DB_NAME}")
print(engine)

conn = engine.connect()
print(conn)

Engine(postgresql://postgres:***@localhost/Public_Transit)
<sqlalchemy.engine.base.Connection object at 0x000001C7334E51D0>

In [2]:
display(df_ch)

     service_date day_type     bus  rail_boardings  total_rides
0      01/01/2001        U  297192          126455       423647
1      01/02/2001        W  780827          501952      1282779
2      01/03/2001        W  824923          536432      1361355
3      01/04/2001        W  870021          550011      1420032
4      01/05/2001        W  890426          557917      1448343
...           ...      ...     ...             ...          ...
8396   10/27/2023        W  503840          373004       876844
8397   10/28/2023        A  360484          275006       635490
8398   10/29/2023        U  250473          185823       436296
8399   10/30/2023        W  551840          367453       919293
8400   10/31/2023        W  520069          390110       910179

[8401 rows x 5 columns]

In [3]:
# df_ch.info()
df_ch.dropna(inplace=True)
df_ch.drop_duplicates(inplace=True)
display(df_ch)
# df_ch.iloc[30:90]

     service_date day_type     bus  rail_boardings  total_rides
0      01/01/2001        U  297192          126455       423647
1      01/02/2001        W  780827          501952      1282779
2      01/03/2001        W  824923          536432      1361355
3      01/04/2001        W  870021          550011      1420032
4      01/05/2001        W  890426          557917      1448343
...           ...      ...     ...             ...          ...
8396   10/27/2023        W  503840          373004       876844
8397   10/28/2023        A  360484          275006       635490
8398   10/29/2023        U  250473          185823       436296
8399   10/30/2023        W  551840          367453       919293
8400   10/31/2023        W  520069          390110       910179

[8339 rows x 5 columns]

In [4]:
display(df_ny)

          Month Agency  Ridership
0    01/01/2008    MNR    6453734
1    02/01/2008    MNR    6144377
2    03/01/2008    MNR    6602280
3    04/01/2008    MNR    6787480
4    04/01/2008    B&T   24900328
..          ...    ...        ...
643  01/01/2024   LIRR    5490105
644  01/01/2024    AAR     928328
645  01/01/2024    SIR     189970
646  01/01/2024    Bus   24912126
647  01/01/2024    B&T   25395118

[648 rows x 3 columns]

In [5]:
# df_ny.dropna(inplace=True)
# df_ny.drop_duplicates(inplace=True)
display(df_ny)

          Month Agency  Ridership
0    01/01/2008    MNR    6453734
1    02/01/2008    MNR    6144377
2    03/01/2008    MNR    6602280
3    04/01/2008    MNR    6787480
4    04/01/2008    B&T   24900328
..          ...    ...        ...
643  01/01/2024   LIRR    5490105
644  01/01/2024    AAR     928328
645  01/01/2024    SIR     189970
646  01/01/2024    Bus   24912126
647  01/01/2024    B&T   25395118

[648 rows x 3 columns]

In [6]:
df_ny.info()
# unique_agencies = df_ny["Agency"].value_counts()
# print(unique_agencies)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 648 entries, 0 to 647
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Month      648 non-null    object
 1   Agency     648 non-null    object
 2   Ridership  648 non-null    int64
dtypes: int64(1), object(2)
memory usage: 15.3+ KB

In [7]:
# try:
#     # Load data for New York
#     df_ny.to_sql('monthly_totals_ny', con=engine, if_exists='append', index=False)
#     print("Data for New York loaded successfully.")

#     # Load data for Chicago
#     df_ch.to_sql('monthly_totals_ch', con=engine, if_exists='append', index=False)
#     print("Data for Chicago loaded successfully.")

# except Exception as e:
#     print("Error occurred:", e)

Data for New York loaded successfully.
Data for Chicago loaded successfully.

In [8]:
# sql = "SELECT * FROM public.monthly_totals_ny LIMIT 100"
# month_df = pd.read_sql(sql, conn)
# month_df.head()

        Month Agency  Ridership
0  01/01/2008    MNR    6453734
1  02/01/2008    MNR    6144377
2  03/01/2008    MNR    6602280
3  04/01/2008    MNR    6787480
4  04/01/2008    B&T   24900328

In [9]:
import pandas as pd
import psycopg2

# Function to load data into PostgreSQL
def load_data_to_postgres(data, table_name):
    conn = psycopg2.connect(
        dbname="your_database_name",
        user="your_username",
        password="your_password",
        host="your_host",
        port="your_port"
    )
    cur = conn.cursor()
    
    # Create table if not exists
    cur.execute(f"CREATE TABLE IF NOT EXISTS {table_name} (month DATE, city VARCHAR(100), transportation_type VARCHAR(10), ridership_count INT)")
    
    # Insert data
    for index, row in data.iterrows():
        cur.execute(f"INSERT INTO {table_name} (month, city, transportation_type, ridership_count) VALUES (%s, %s, %s, %s)",
                    (row['month'], row['city'], row['transportation_type'], row['ridership_count']))
    
    conn.commit()
    conn.close()

# Read NYC Subway Monthly Ridership data
df_ny = pd.read_csv("C:/Users/micha/PycharmProjects/Docs/MTA_Monthly_Ridership___Traffic_Data__Beginning_January_2008.csv")
df_ch = pd.read_csv("C:/Users/micha/PycharmProjects/Docs/CTA_-_Ridership_-_Daily_Boarding_Totals_20240307.csv")

nyc_data = pd.read_csv("nyc_subway_monthly_ridership.csv")
nyc_data['city'] = 'NYC'

# Read Chicago CTA Daily Boarding Totals data
chicago_data = pd.read_csv("chicago_cta_daily_boarding_totals.csv")
chicago_data['city'] = 'Chicago'

# Combine data from both cities
combined_data = pd.concat([nyc_data, chicago_data])

# Transform data to match target schema
combined_data['month'] = pd.to_datetime(combined_data['month'])
combined_data.rename(columns={'total_ridership': 'ridership_count'}, inplace=True)

# Load combined data into PostgreSQL
load_data_to_postgres(combined_data, "monthly_totals")

FileNotFoundError: [Errno 2] No such file or directory: 'nyc_subway_monthly_ridership.csv'